## Concatenation
Concatenation = stacking DataFrames either vertically (rows) or horizontally (columns).

In [1]:
import pandas as pd

In [5]:
df1 = pd.DataFrame({
    'Name' : ['Alice', 'Bob', 'Charlie'],
    'Age' : [23, 45, 34]
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'Name' : ['Maaz', 'Sofia', 'Zoha'],
    'Age' : [12, 56, 77]
}, index=[1, 2, 3])

In [6]:
pd.concat([df1, df2])

      Name  Age
1    Alice   23
2      Bob   45
3  Charlie   34
1     Maaz   12
2    Sofia   56
3     Zoha   77

In [7]:
pd.concat([df1, df2], axis=1)

      Name  Age   Name  Age
1    Alice   23   Maaz   12
2      Bob   45  Sofia   56
3  Charlie   34   Zoha   77

In [9]:
pd.concat([df1, df2], keys=['G1', 'G2'])

         Name  Age
G1 1    Alice   23
   2      Bob   45
   3  Charlie   34
G2 1     Maaz   12
   2    Sofia   56
   3     Zoha   77